# Data Merging
Data merging is the process of combining two or more datasets based on a common field or key.

In [1]:
import pandas as pd

In [4]:
data1 = {
    'id':[1,2,3],
    'name':['Abdullah', 'Ahmad', 'Ali'],
    'age':[21, 20, 22]
}
df1 = pd.DataFrame(data1)
df1

   id      name  age
0   1  Abdullah   21
1   2     Ahmad   20
2   3       Ali   22

In [5]:
data2 = {
    'id':[1,2,4],
    'city':['Faisalabad', 'Islamabad', 'Multan'],
    'occupation':['Data Scientist', 'ML Engineer', 'Software Engineer']
}
df2 = pd.DataFrame(data2)
df2

   id        city         occupation
0   1  Faisalabad     Data Scientist
1   2   Islamabad        ML Engineer
2   4      Multan  Software Engineer

In [6]:
# Merging data frames
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df

   id      name  age        city      occupation
0   1  Abdullah   21  Faisalabad  Data Scientist
1   2     Ahmad   20   Islamabad     ML Engineer